#-------------------------------------------------
#
# Project created by QtCreator 2013-05-24T06:50:07
#
#-------------------------------------------------
#--------------------------------------------------------------------------------------
#                           CRC16/32校验
#    1、此程序可以由地三方程序调用，也可以直接打开，但是功能不一样。
#    2、基本功能：CRC16/32,大小端，可以使用三方程序调用，主要是针对bin文件，不会影响原bin文件。
#    3、完成时间：2019年6月11日14:26:39
#    4、历时两周吧。
#--------------------------------------------------------------------------------------

QT       += core gui

greaterThan(QT_MAJOR_VERSION, 4): QT += widgets

TARGET = MakeCRC16
TEMPLATE = app


SOURCES += main.cpp\
        dialog.cpp \
    Util/crc16.c

HEADERS  += dialog.h \
    Util/crc16.h \
    type.h

FORMS    += dialog.ui
